In [1]:
import os
import sys

import pandas as pd
#pd.set_option('display.max_colwidth', None) # Wrap text in cells to show all of large fields
#pd.options.display.float_format = '{:.3f}'.format # 3 decimal places
import numpy as np
#import plotly_express as px
#import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

os.getcwd() #listdir(), mkdir(), chdir()

'/Users/chris/GitHub/course-files/IB2023'

In [ ]:
pd.show_versions(as_json=False)

In [3]:
df = pd.DataFrame([(4,10), (6, np.nan), (10,15), (14,19), (16, 7), (19, None)], columns=['xcol', 'ycol'])
df['alpha'] = list('abcdef')
df.insert(2, 'zcol', df.xcol + df.ycol)
display(df)
display(df.loc[2:2]) # df.loc[2:2] and .loc[[2]] return dataframe, df.loc[2] returns series
display(df[['xcol']]) # df.xcol and df['xcol'] return pd.Series instead of DataFrame
df.set_index('alpha', inplace=True)
display('count the number of NaNs: ', df.isnull().sum())
df.dropna(inplace=True)
df.drop(df.index[df.xcol>12])

display(df.loc[['a', 'd'], 'ycol':'zcol'])  # select on single value, list, slice (including ':')
display(df.query('xcol<16 & zcol>15')) # pd: &, |, ~ versus python: and, or, not
df[df.zcol.isin([10, 33])][['xcol', 'ycol']] # .between(10, 33, inclusive=False)]

   xcol  ycol  zcol alpha
0     4  10.0  14.0     a
1     6   NaN   NaN     b
2    10  15.0  25.0     c
3    14  19.0  33.0     d
4    16   7.0  23.0     e
5    19   NaN   NaN     f

   xcol  ycol  zcol alpha
2    10  15.0  25.0     c

   xcol
0     4
1     6
2    10
3    14
4    16
5    19

'count the number of NaNs: '

xcol    0
ycol    2
zcol    2
dtype: int64

       ycol  zcol
alpha
a      10.0  14.0
d      19.0  33.0

       xcol  ycol  zcol
alpha
c        10  15.0  25.0
d        14  19.0  33.0

       xcol  ycol
alpha
d        14  19.0

In [4]:
# loop rows with itertuples()
df = pd.DataFrame([(4,10, 'a'), (10,15, 'b'), (14,19, 'c')], columns=['xcol', 'ycol', 'alpha'])
display(df)
for row_tuple in df.itertuples():  # also iteritems() works over columns
    print(row_tuple[0], row_tuple[1:-1])
    print(row_tuple.Index, row_tuple.alpha)

   xcol  ycol alpha
0     4    10     a
1    10    15     b
2    14    19     c

0 (4, 10)
0 a
1 (10, 15)
1 b
2 (14, 19)
2 c

In [5]:
# Summary of dataframe
df = pd.DataFrame({'Name':['Cat', 'Dog', 'Fish', 'Cow'],'A':['$400', '$100', '$2,000', np.nan], 'B':['$100', '$2,000', 'None', '$100']})
print(df.B.value_counts()) #.head(), .info(), .describe(), .columns, .dtypes df.col_name.value_counts()
df.describe()

$100      2
$2,000    1
None      1
Name: B, dtype: int64

       Name     A     B
count     4     3     4
unique    4     3     3
top     Cat  $400  $100
freq      1     1     2

In [6]:
# change values
display(df)
#df.A = df.A.apply(lambda x: x if x == 'None' else float(x.replace('$', '').replace(',','')))
df.loc[df.Name == 'Dog', 'flag'] = 11
df.loc[df.A.isna(), 'B'] = '$880'

key_val = {'$100':'hundred','$400':'many', None:'missing'}
df['A'].replace(key_val, inplace=True)

df['is_cow'] = df.Name.apply(lambda x: 77 if 'Cow' == x else None)

df

   Name       A       B
0   Cat    $400    $100
1   Dog    $100  $2,000
2  Fish  $2,000    None
3   Cow     NaN    $100

   Name        A       B  flag  is_cow
0   Cat     many    $100   NaN     NaN
1   Dog  hundred  $2,000  11.0     NaN
2  Fish   $2,000    None   NaN     NaN
3   Cow  missing    $880   NaN    77.0

In [7]:
# Rename table labels columns or indexes
df = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6]})
df.rename(columns={"A": "a", "B": "c"}) #inplace=False is default
df.rename(index={0: "x", 1: "y", 2: "z"})
df.rename(str.lower, axis='columns') #apply function to column or index values; str.strip to remove whitespace
#https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html?highlight=rename%20column
df.columns = df.columns.str.strip().str.lower().str.replace(' ', '_') # cleans column names
df

   a  b
0  1  4
1  2  5
2  3  6

In [8]:
import string
letters = [s for s in string.ascii_letters[0:10]] # also ascii_lowercase, ascii_uppercase
w = [x for x in range(100, 80, -2)]
evens = np.linspace(2,20,10)
y = ['dog', 'cat', 'cow', 'rat', 'dog', 'fish', 'cat', 'bird', 'dog', 'cow']
rand = np.random.normal(0, 1, 10).round(2)

data = list(zip(w, evens, y, rand, letters))
names = ['desc', 'evens', 'animals', 'normal', 'letters']
df = pd.DataFrame(data, columns=names) # index=letters
df.set_index('letters', inplace=True)
print('Slice\n', df.loc['a':'c', 'evens':'normal'], '\n') # Note second end point is included
print('\nSelect by list of Index & column values\n', df.loc[['a', 'c', 'd'], ['animals', 'normal']], '\n')
print(df[df.desc >=96].sort_values('normal', ascending=False))
print('\nSearch column text\n', df[df.animals.str.contains('d')][['animals', 'evens', 'normal']])
print('\nSelect by column isin list\n', df[df.animals.isin(['cow', 'rat'])]) #if error for single string, put in list
print('\nSelect by query\n', df.query('normal>0 & evens<13'))

mask = df['animals'].str.startswith('c') #endswith
df.loc[mask, 'normal'] = 999
print('\nAssign using a mask\n', df)

Slice
          evens animals  normal
letters
a          2.0     dog   -2.51
b          4.0     cat   -0.83
c          6.0     cow   -0.73


Select by list of Index & column values
         animals  normal
letters
a           dog   -2.51
c           cow   -0.73
d           rat   -0.77

         desc  evens animals  normal
letters
c          96    6.0     cow   -0.73
b          98    4.0     cat   -0.83
a         100    2.0     dog   -2.51

Search column text
         animals  evens  normal
letters
a           dog    2.0   -2.51
e           dog   10.0    0.11
h          bird   16.0   -1.86
i           dog   18.0    0.54

Select by column isin list
          desc  evens animals  normal
letters
c          96    6.0     cow   -0.73
d          94    8.0     rat   -0.77
j          82   20.0     cow   -1.11

Select by query
          desc  evens animals  normal
letters
e          92   10.0     dog    0.11

Assign using a mask
          desc  evens animals  normal
letters
a         100    2.0     dog   -2.51
b          98    4.0     cat  999.00
c          96    6.0     cow  999.00
d          94    8.0     rat   -0.77
e          92   10.0     dog    0.11
f          90   12.0    fish   -1.37
g          88   14.0     cat  999.00
h          86   16.0    bird   -1.86
i          84   18.0     dog    0.54
j          82   20.0     cow  999.00

In [9]:
# str functions
# https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html
students = pd.DataFrame({'full_name':["Abe Lincoln", "Roger Merris", "Neil Armstrong", "Alexandria Ocasio Cortez"]})
name_split = students.full_name.str.split(' ') # note expand=True functionality, df.col.str.split('(\d+)', expand=True)[1]
students['first_name'] = name_split.str.get(0)
students['last_name'] = name_split.str[-1] #note incorrect handling of two last names
students['alt_last_names'] = students.full_name.str.split(' ', n=1).str.get(1) #also str.rsplit from the right
display(students)

pathnames = pd.DataFrame({'full':['/usr/me/git/dir/file', '/usr/me/git/dir2/file2', '/usr/me/git/dir3/file3']})
pathnames[['path', 'directory', 'file']] = pathnames.full.str.rsplit('/', n=2, expand=True)
pathnames

                  full_name  first_name  last_name alt_last_names
0               Abe Lincoln         Abe    Lincoln        Lincoln
1              Roger Merris       Roger     Merris         Merris
2            Neil Armstrong        Neil  Armstrong      Armstrong
3  Alexandria Ocasio Cortez  Alexandria     Cortez  Ocasio Cortez

                     full         path directory   file
0    /usr/me/git/dir/file  /usr/me/git       dir   file
1  /usr/me/git/dir2/file2  /usr/me/git      dir2  file2
2  /usr/me/git/dir3/file3  /usr/me/git      dir3  file3

In [10]:
roster_df = pd.DataFrame({'full_name': ['Arling, Teo  ', 'Meke, Ben', 'Seetle, Steve'],
                         'location': ['Room 301', 'Rm 123', 'Room 456']})
roster_df['room_num'] = roster_df.location.str.split(' ').str[1].astype('int')
roster_df[['last_name', 'first_name']] = roster_df['full_name'].str.split(',', expand=True)
roster_df['first_name'] = roster_df['first_name'].str.strip()
display(roster_df.loc[0,'first_name'])
roster_df.dtypes

'Teo'

full_name     object
location      object
room_num       int64
last_name     object
first_name    object
dtype: object

In [11]:
print('start', '\n', r'\n')
df = pd.DataFrame({'A':['start', '\n  \t \n', r'\n']})

df.A.str.match('\\n\s*\\n')

start
 \n

0    False
1     True
2    False
Name: A, dtype: bool

## regex
pipe to match alternative strings, e.g. 'abc|xyz' \
brackets to match a single character from a list, e.g. '[abc]' \
a range of characters is indicated with a dash ('-'), multiples allowed, e.g. '[a-zA-Z]' \
carat (negation) to match any but a list of characters, e.g. '[^pqr]' \
period as wild card character, e.g. 'p.t' matches pit, pat, pot, pet, etc. \
escape character is back slash ('\\'). e.g. '\\.' matches period \
shortcuts for characters, digits, or spaces/tabs/returns. (CAP is negation), e.g. '\w' = [A-Za-z0-9_], '\d', '\s', '\W'... \
parentheses group expressions and curly brackets multiply (value or range by comma), e.g. 'my (cat|dog)', 'od{2}' \
question mark after optional character, e.g. 'bol?t' matches 'bot' and 'bolt'; 'a (big)? ship' \
star or plus matches zero (one) or more of the preceding character, e.g. 'so+t' matches 'sot', 'sooot', etc, but not 'st' \
anchor symbols hat '^' and dollar sign '$' require that match initiate/end string

In [12]:
df = pd.DataFrame({'A':['Cat', 'Dog', 'Fish', 'Cow'], 'B':['$100', r'\begin{enumerate}', '\\end{enumerate}', '$50 \end']})
df.insert(1, 'A_contains_Co', df.A.str.contains('Co'))
df['contains_dollar'] = df.B.str.contains('\$')
df['contains_slash_begin'] = df.B.str.contains(r'\\begin{enumerate}')#, regex=True)
df['begins_slash'] = df.B.str.contains(r'^\\')
df

,A,A_contains_Co,B,contains_dollar,contains_slash_begin,begins_slash
0,Cat,False,$100,True,False,False
1,Dog,False,\begin{enumerate},False,True,True
2,Fish,False,\end{enumerate},False,False,True
3,Cow,True,$50 \end,True,False,False

In [13]:
df = pd.DataFrame({'pset_ID':range(100,106), 'Q':[r'\n', r'\n x   \n', r'  \n', r'\begin{enumerate}', '\\end{enumerate}', '\n \end']})
df.Q.str.extract(r'([\\n]?[\s]*[\\n]?)(enum\w*)', expand=True)
df[r'match nline'] = df.Q.str.match(r'\\n')
df[r'contains nline'] = df.Q.str.contains(r'\\n')
df

   pset_ID                  Q  match nline  contains nline
0      100                 \n         True            True
1      101          \n x   \n         True            True
2      102                 \n        False            True
3      103  \begin{enumerate}        False           False
4      104    \end{enumerate}        False           False
5      105            \n \end        False           False

In [14]:
df = pd.DataFrame({'pset_ID':range(100,106), 'Q':[r'\n', r'\n    \n', r'  \n', r'\begin{enumerate}', '\\end{enumerate}', '\n \end']})
print(df.dtypes)
print(df[df.Q != r'\n'])
df.Q.str.match('\s')

pset_ID     int64
Q          object
dtype: object
   pset_ID                  Q
1      101           \n    \n
2      102                 \n
3      103  \begin{enumerate}
4      104    \end{enumerate}
5      105            \n \end

0    False
1    False
2     True
3    False
4    False
5     True
Name: Q, dtype: bool

In [15]:
# Clean numeric data as strings with dollar signs and commas, NaNs
df = pd.DataFrame({'Name':['Cat', 'Dog', 'Fish', 'Cow'],'A':['$400', '$100', '$2,000', 'None'], 'B':['$100', '$2,000', 'None', '$5,000']})
print(df, '\n')
df.A = df.A.apply(lambda x: x if x == 'None' else float(x.replace('$', '').replace(',','')))
df.A = df.A.apply(pd.to_numeric, errors='coerce') #replace string values with NaNs

# df['Value'] = df.Value.replace('[\$,]','',regex=True).astype(float) #alternative
print(df[df.A.notnull()], '\n'*2, df[df.A.isnull()])
df.A.mean()

   Name       A       B
0   Cat    $400    $100
1   Dog    $100  $2,000
2  Fish  $2,000    None
3   Cow    None  $5,000

   Name       A       B
0   Cat   400.0    $100
1   Dog   100.0  $2,000
2  Fish  2000.0    None

   Name   A       B
3  Cow NaN  $5,000

833.3333333333334

In [16]:
# Merge and concatenate dataframes
df1 = pd.DataFrame({'nums':[1,3,5,7],'letters':['a','b','f','g']})
df2 = pd.DataFrame([[1,'xx'],[3,'yy'],[9,'ww']], columns=['nums','doubles'])
df3 = pd.DataFrame([(5,'mm'),(11,'pp')], columns=['nums','doubles'])
print(df1, '\n', df2, '\n', df3)

print(pd.merge(df1, df2)) # how=inner, left, right, outer; left_on, right_on
pd.concat([df2, df3]).reset_index(drop=True)

   nums letters
0     1       a
1     3       b
2     5       f
3     7       g
    nums doubles
0     1      xx
1     3      yy
2     9      ww
    nums doubles
0     5      mm
1    11      pp
   nums letters doubles
0     1       a      xx
1     3       b      yy

   nums doubles
0     1      xx
1     3      yy
2     9      ww
3     5      mm
4    11      pp

In [17]:
# I/O
#df = pd.read_csv(url_or_filename, index_col='column_name') # usecols=['col1', 'col2']

#objects are stored as strings, so must be converted back to objects
#or convert on read: df = pd.read_csv(file, converters={'list_col':literal_eval})
from ast import literal_eval
df = pd.DataFrame({'A':[1, 2, 3], 'B':['a', 'b', 'c'], 'list_col':['[1,3]','["d", "e", "f"]', '[3, 4, 5]']})
print(df, '\n list_col is of type: ', type(df.loc[2,'list_col']), '\n')
df.list_col = df.list_col.apply(literal_eval)
print(df, '\n list_col is of type: ', type(df.loc[2,'list_col']), '\n')

   A  B         list_col
0  1  a            [1,3]
1  2  b  ["d", "e", "f"]
2  3  c        [3, 4, 5]
 list_col is of type:  <class 'str'>

   A  B   list_col
0  1  a     [1, 3]
1  2  b  [d, e, f]
2  3  c  [3, 4, 5]
 list_col is of type:  <class 'list'>

In [19]:
# Jupyter magic
!pwd #run shell command
%cd /Users/chris/GitHub/course-files/IB2023
!pwd

%lsmagic

/Users/chris/GitHub/course-files/IB2023
/Users/chris/GitHub/course-files/IB2023
/Users/chris/GitHub/course-files/IB2023

Available line magics:
%alias  %alias_magic  %autoawait  %autocall  %automagic  %autosave  %bookmark  %cat  %cd  %clear  %colors  %conda  %config  %connect_info  %cp  %debug  %dhist  %dirs  %doctest_mode  %ed  %edit  %env  %gui  %hist  %history  %killbgscripts  %ldir  %less  %lf  %lk  %ll  %load  %load_ext  %loadpy  %logoff  %logon  %logstart  %logstate  %logstop  %ls  %lsmagic  %lx  %macro  %magic  %man  %matplotlib  %mkdir  %more  %mv  %notebook  %page  %pastebin  %pdb  %pdef  %pdoc  %pfile  %pinfo  %pinfo2  %pip  %popd  %pprint  %precision  %prun  %psearch  %psource  %pushd  %pwd  %pycat  %pylab  %qtconsole  %quickref  %recall  %rehashx  %reload_ext  %rep  %rerun  %reset  %reset_selective  %rm  %rmdir  %run  %save  %sc  %set_env  %store  %sx  %system  %tb  %time  %timeit  %unalias  %unload_ext  %who  %who_ls  %whos  %xdel  %xmode

Available cell magics:
%%!  %%HTML  %%SVG  %%bash  %%capture  %%debug  %%file  %%html  %%javascript  %%js  %%latex  %%markdown  %%perl  %%prun  %%pypy  %%python  %%python2  %%python3  %%ruby  %%script  %%sh  %%svg  %%sx  %%system  %%time  %%timeit  %%writefile

Automagic is ON, % prefix IS NOT needed for line magics.

In [20]:
# View -> Cell Toolbar -> Slideshow (shows selection menu for which cells to display)
!jupyter nbconvert <notebook name> --to slides --post serve #render slides (can be run in terminal)

zsh:1: no such file or directory: notebook

In [21]:
clipboard_df = pd.read_clipboard()
clipboard_df

   2     Monday     red   5.2
0  4    Tuesday  yellow   6.7
1  6  Wednesday  orange   8.3
2  8   Thursday    blue  11.4

In [ ]:
cc = pd.read_csv('Codecademy/roller_coaster_starting/roller_coasters.csv') #captaincoasters.com
seating_summary = cc.groupby('seating_type')[['speed', 'height', 'length', 'num_inversions']].mean()
seating_summary['count'] = cc.groupby('seating_type').name.count()
seating_summary.sort_values(by='count', inplace=True, ascending=False)
seating_summary.fillna('').round()[:10]

                 speed  height  length  num_inversions  count
seating_type
Sit Down       69.7589    26.0   597.0             1.0   2214
Spinning       50.0606    15.0   386.0             0.0    150
Inverted       80.0545    33.0   707.0             4.0    122
Suspended      53.9667    20.0   472.0             0.0     55
Alpine         38.3333    25.0   864.0             0.0     43
na                        19.0   628.0             0.0     40
Water Coaster    76.05    30.0   498.0             0.0     29
Floorless      98.2083    46.0   944.0             4.0     27
Flying          70.125    30.0   733.0             3.0     27
Motorbike         71.4    17.0   549.0             0.0     21

In [ ]:
manu = cc.groupby(['manufacturer', 'material_type']).name.count().reset_index()
manu_table = manu.pivot(columns='material_type', index='manufacturer', values='name')
manu_table['Total'] = manu_table.sum(axis=1, skipna=True)
manu_table[manu_table.index != 'na'].sort_values(by=['Steel', 'Total'], ascending=[False, True]).fillna('')[:8]

material_type Hybrid Steel Wooden  na  Total
manufacturer
Vekoma                 243      3  51  297.0
Zierer                 126         14  140.0
Intamin                126      8  18  152.0
Mack                   122         10  132.0
B&M                    121          8  129.0
Zamperla               120         40  160.0
Pinfari                108         26  134.0
Schwarzkopf             98      1   7  106.0

In [22]:
# Copying
original = [2, 4, 5, 6, 7]
shallow_copy = original
deep_copy = original[:] #for lists
#print(original, '\n', shallow_copy, '\n', deep_copy)
shallow_copy[2] = 'dog'
#print(original, '\n', shallow_copy, '\n', deep_copy, '\n'*2)

df = pd.DataFrame({'A':[11, 12, 13], 'B':['dog', 'cat', 'cow']})
df_shallow_copy = df.loc[0:1]  #slices are views (shallow copies)
display(df_shallow_copy)
df_deep_copy = df.copy() #for deep copy of dataframe
df_shallow_copy.loc[0, 'A'] = 55
display(df_shallow_copy, df)

    A    B
0  11  dog
1  12  cat

    A    B
0  55  dog
1  12  cat

    A    B
0  55  dog
1  12  cat
2  13  cow

In [23]:
problems = ['abc', '\n', r'\n', '', '\n', 'xyz', ' ', 'a12']
print(problems)
newline = [r'\n']
while True:
    try: 
        problems.remove(newline)
    except:
        break
empty = []
while True:
    try: 
        problems.remove(empty)
    except:
        break
print(problems)

['abc', '\n', '\\n', '', '\n', 'xyz', ' ', 'a12']
['abc', '\n', '\\n', '', '\n', 'xyz', ' ', 'a12']

In [24]:
problems = ['abc', '\n', r'\n', '', '\n\n', 'xyz', ' ', 'a12']
pat = '\n\n'
problems.remove(pat)

for p in problems:
    print(p, len(p))

abc 3

 1
\n 2
 0
xyz 3
  1
a12 3